"""
Python简介
Python的历史
1989年圣诞节：Guido von Rossum开始写Python语言的编译器。
1991年2月：第一个Python编译器（同时也是解释器）诞生，它是用C语言实现的
（后面又出现了Java和C#实现的版本Jython和IronPython，以及PyPy、Brython、Pyston等其他实现），可以调用C语言的库函数。
在最早的版本中，Python已经提供了对“类”，“函数”，“异常处理”等构造块的支持，同时提供了“列表”和“字典”等核心数据类型，同时支持以模块为基础的拓展系统。
1994年1月：Python 1.0正式发布。
2000年10月16日：Python 2.0发布，增加了实现完整的垃圾回收，提供了对Unicode的支持。
与此同时，Python的整个开发过程更加透明，社区对开发进度的影响逐渐扩大，生态圈开始慢慢形成。

2008年12月3日：Python 3.0发布，它并不完全兼容之前的Python代码，不过因为目前还有不少公司在项目和运维中使用Python 2.x版本，
所以Python 3.x的很多新特性后来也被移植到Python 2.6/2.7版本中。
目前我们使用的Python 3.7.x的版本是在2018年发布的，Python的版本号分为三段，形如A.B.C。
其中A表示大版本号，一般当整体重写，或出现不向后兼容的改变时，增加A；
B表示功能更新，出现新功能时增加B；
C表示小的改动（如修复了某个Bug），只要有修改就增加C。

如果对Python的历史感兴趣，可以查看一篇名为《Python简史》的博文。

"""

