"""
用程序来处理图像和办公文档经常出现在实际开发中，
Python的标准库中虽然没有直接支持这些操作的模块，
但我们可以通过Python生态圈中的第三方模块来完成这些操作。

操作图像
计算机图像相关知识
颜色。如果你有使用颜料画画的经历，那么一定知道混合红、黄、蓝三种颜料可以得到其他的颜色，
事实上这三种颜色就是被我们称为美术三原色的东西，它们是不能再分解的基本颜色。
在计算机中，我们可以将红、绿、蓝三种色光以不同的比例叠加来组合成其他的颜色，因此这三种颜色就是色光三原色，
所以我们通常会将一个颜色表示为一个RGB值或RGBA值（其中的A表示Alpha通道，它决定了透过这个图像的像素，也就是透明度）。

名称	RGBA值	名称	RGBA值
White	(255, 255, 255, 255)	Red	(255, 0, 0, 255)
Green	(0, 255, 0, 255)	Blue	(0, 0, 255, 255)
Gray	(128, 128, 128, 255)	Yellow	(255, 255, 0, 255)
Black	(0, 0, 0, 255)	Purple	(128, 0, 128, 255)
像素。对于一个由数字序列表示的图像来说，最小的单位就是图像上单一颜色的小方格，
这些小方块都有一个明确的位置和被分配的色彩数值，而这些一小方格的颜色和位置决定了该图像最终呈现出来的样子，
它们是不可分割的单位，我们通常称之为像素（pixel）。
每一个图像都包含了一定量的像素，这些像素决定图像在屏幕上所呈现的大小。


用Pillow操作图像
Pillow是由从著名的Python图像处理库PIL发展出来的一个分支，通过Pillow可以实现图像压缩和图像处理等各种操作。可以使用下面的命令来安装Pillow。

"""

